function replacesTones(text) {
    let newText = "";
    let newLetter = undefined;
    const tonesMap = {
        "α" : "[αά]",
        "ά" : "[αά]",
        "Α" : "[ΑΆ]",
        "Ά" : "[ΑΆ]",
        "ε" : "[εέ]",
        "έ" : "[εέ]",
        "Ε" : "[ΕΈ]",
        "Έ" : "[ΕΈ]",
        "η" : "[ηή]",
        "ή" : "[ηή]",
        "Η" : "[ΗΉ]",
        "Ή" : "[ΗΉ]",
        "ι" : "[ιίϊΐ]",
        "ί" : "[ιίϊΐ]",
        "ϊ" : "[ιίϊΐ]",
        "ΐ" : "[ιίϊΐ]",
        "Ι" : "[ΙΊΪ]",
        "Ί" : "[ΙΊΪ]",
        "Ϊ" : "[ΙΊΪ]",
        "ο" : "[οό]",
        "ό" : "[οό]",
        "Ο" : "[ΟΌ]",
        "Ό" : "[ΟΌ]",
        "υ" : "[υύϋΰ]",
        "ύ" : "[υύϋΰ]",
        "ϋ" : "[υύϋΰ]",
        "ΰ" : "[υύϋΰ]",
        "Υ" : "[ΥΎΫ]",
        "Ύ" : "[ΥΎΫ]",
        "Ϋ" : "[ΥΎΫ]",
        "ω" : "[ωώ]",
        "ώ" : "[ωώ]",
        "Ω" : "[ΩΏ]",
        "Ώ" : "[ΩΏ]",
        "΅" : "",
        "΄" : "",
        "¨" : ""
    };

    for (let letter of text) {
        newLetter = tonesMap[letter];

        if (newLetter === undefined) {
            newText += letter;
        }
        else {
            newText += newLetter;
        }
    }

    return newText;
}

export {replacesTones};
